master/cases/halle/2D/spray_4/fineMesh.gasflow/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPointFace;

setFormat     raw;

sets
(
    inlet 
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0 );
        end     ( 0.100 0 0 );
        nPoints 500;
    }
	z2mm
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.002 );
        end     ( 0.100 0 0.002 );
        nPoints 500;
    }
	z25mm
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.025 );
        end     ( 0.100 0 0.025 );
        nPoints 500;
    }
	 z50mm
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.05 );
        end     ( 0.100 0 0.05 );
        nPoints 500;
    }
	z100mm
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.1 );
        end     ( 0.100 0 0.1 );
        nPoints 500;
    }
	z200mm 
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.2 );
        end     ( 0.100 0 0.2 );
        nPoints 500;
    }
	z300mm
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.3 );
        end     ( 0.100 0 0.3 );
        nPoints 500;
    }
	z400mm
    {
        type    uniform;
        axis    x;
        start   ( 0 0 0.4 );
        end     ( 0.100 0 0.4 );
        nPoints 500;
    }
);

surfaces ();

fields          ( U );


// ************************************************************************* //
